{
    "main": {
        "name": "Patrick Charlton",
        "occupation": "Software Developer",
        "description": "focused on building mobile and web applications with eye-catching UIs and seamless UX design",
        "image": "profilepic.jpg",
        "bio": "I aim to use my skills as a software developer to push boundaries, drive innovation, and design effective and efficient software solutions for real world problems. I thrive in collaborative environments with others who constantly push me to become better. \n\n While I am a bit of a polyglot programmer, my passion is for front end and mobile engineering as it lets my artistic side shine through the most. The majority of my experience lies in native Android development, as well as hybrid mobile and web development with modern frameworks like React and React Native. \n Aside from programming, I have achieved success as an athlete and artist through creativity and perseverance. My favorite mediums include watercolors, oils, my trusty fiddle, clean-cut grass on the footy pitch, and untouched snow deep in the mountains.",
        "contactmessage": "Feel free to contact me below.",
        "email": "patrick.charlton6@gmail.com",
        "phone": "360-774-0560",
        "address": {
            "street": "107 N Cook Street",
            "city": "Portland",
            "state": "Oregon",
            "zip": "97227"
        },
        "website": "https://prcharlton.com/",
        "resumedownload": "https://pdfhost.io/v/fxjhjgqtq_Resume_for_Software_Engineerpdf.pdf",
        "social": [{
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/patrick-charlton/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/top_slav/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/patadactyl",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "skillmessage": "Languages and Frameworks listed by proficiency",
        "education": [{
            "school": "Willamette University",
            "degree": "Bachelor of Arts in Computer Science",
            "graduated": "May 2020",
            "description": "I spent most of my time running between the music studio, the soccer pitch, and the research lab. \nI created Willamette's Mobile App Development Club for students to collaborate and learn real-world skills, served as the Community Service Chair for the Delta Zeta chapter of the Sigma Chi Fraternity, and let off steam playing electric violin (yes, electric violin) for a local band, Call Falck."
        }],
        "work": [{
                "company": "Oregon Health & Science University",
                "title": "Research Assistant 2",
                "years": "November 2020 - Present",
                "description": "Conducted research in collaboration with clinical researchers in the Division of Pulmonary and Critical Care Medicine at OHSU to improve the quality and standard of healthcare for critical care and pulmonary disease patients, and enhance patient-clinician communication."
            },
            {
                "company": "Happy Hour App",
                "title": "Frontend Engineer Intern",
                "years": "August 2020 - March 2021",
                "description": "Helped develop a React Native mobile app on iOS and Android to provide an interactive map for happy hour deals and promotions for local bars and restaurants in the user’s area. \nDesigned the client-side website’s landing page, including icons, for onboarding bars and restaurants and implemented those designs using the Bootstrap 4 framework."
            },
            {
                "company": "Artist Integrated",
                "title": "Android Developer",
                "years": "September 2019 - May 2020",
                "description": "Developed a location-based Android app with an MVVM architecture in Kotlin from design through implementation to provide a platform for artists to collaborate with each other and gain exposure through online methods."
            },
            {
                "company": "Kroger",
                "title": "Android Engineer Intern",
                "years": "May 2019 - August 2019",
                "description": "Collaborated with team members using Scrum Agile Methodology (JIRA, Daily Standup, Sprint Backlog, Retrospectives, GitLab, Code Reviews, Unit Tests) to develop convenient, polished mobile apps for Kroger and its subsidiaries. \nOwned refund and other features on post-order pages, creating a user-friendly environment for consumers to view and interact with their pending, cancelled, and completed orders."
            }
        ],
        "skills": [{
                "name": "Git",
                "level": "75%"
            },
            {
                "name": "JavaScript",
                "level": "80%"
            },
            {
                "name": "React",
                "level": "75%"
            },
            {
                "name": "Kotlin",
                "level": "70%"
            },
            {
                "name": "Java",
                "level": "80%"
            },
            {
                "name": "Python",
                "level": "60%"
            },
            {
                "name": "Node.js",
                "level": "50%"
            },
            {
                "name": "Vue.js",
                "level": "20%"
            },
            {
                "name": "SQL",
                "level": "30%"
            },
            {
                "name": "MVVM",
                "level": "65%"
            },
            {
                "name": "MVP",
                "level": "70%"
            },
            {
                "name": "Dagger",
                "level": "20%"
            },
            {
                "name": "RxJava",
                "level": "30%"
            }
        ]
    },
    "portfolio": {
        "projects": [{
                "title": "Happy Hour",
                "category": "Landing Page design for the Happy Hour App's client-facing website",
                "image": "happyhour.jpg",
                "url": "https://www.happyhr.io"
            },
            {
                "title": "Artist Integrated",
                "category": "Location-based live events app for Android and iOS",
                "image": "artistintegrated.jpg",
                "url": "https://www.behance.net/gallery/104075627/Artist-Integrated"
            },
            {
                "title": "Art Videos",
                "category": "Progressive Web App to display a list of videos pulled from an API",
                "image": "art-videos.png",
                "url": "https://romantic-borg-812440.netlify.app/"
            },
            {
                "title": "Jax",
                "category": "Illustration created in Fresco of the beloved doggo Jax",
                "image": "jax.jpg",
                "url": "https://www.behance.net/gallery/122621819/Jax"
            }
        ]
    }
}